<!-- add-pr-comment:poc-tfplan -->

Terraform plan output for poc

```text


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.backstage.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:us-east-1:884360309640:service/arc-poc-cluster/arc-poc-cluster-backstage"
        name                               = "arc-poc-cluster-backstage"
        tags                               = {
            "Environment" = "poc"
            "MonoRepo"    = "False"
            "Name"        = "arc-poc-cluster-backstage"
            "Project"     = "arc"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:884360309640:task-definition/arc-poc-cluster-backstage:33" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backstage.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:us-east-1:884360309640:task-definition/arc-poc-cluster-backstage:33" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:884360309640:task-definition/arc-poc-cluster-backstage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "arc-poc-cluster-backstage" -> (known after apply)
      ~ revision                 = 33 -> (known after apply)
        tags                     = {
            "Environment" = "poc"
            "MonoRepo"    = "False"
            "Name"        = "arc-poc-cluster-backstage"
            "Project"     = "arc"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

